insert ignore into schools(id,name) values
(1,'不明'),
(2,'school1'),
(3,'school2');


INSERT IGNORE INTO classes (class_id, subject, name) VALUES
(1, '国語', 'N/A'),
(2, '国語', '特選'),
(3, '国語', 'α'),
(4, '国語', 'β1'),
(5, '国語', 'β2'),
(6, '国語', 'サッカー1'),
(7, '国語', 'サッカー2'),
(8, '数学', 'N/A'),
(9, '数学', '特選'),
(10, '数学', 'α'),
(11, '数学', 'β1'),
(12, '数学', 'β2'),
(13, '数学', 'サッカー1'),
(14, '数学', 'サッカー2'),
(15, '英語', 'N/A'),
(16, '英語', '特選'),
(17, '英語', 'α'),
(18, '英語', 'β1'),
(19, '英語', 'β2'),
(20, '英語', 'サッカー1'),
(21, '英語', 'サッカー2'),
(22, '理科', 'N/A'),
(23, '理科', '特選'),
(24, '理科', 'α'),
(25, '理科', 'β1'),
(26, '理科', 'β2'),
(27, '理科', 'サッカー1'),
(28, '理科', 'サッカー2'),
(29, '社会', 'N/A'),
(30, '社会', '特選'),
(31, '社会', 'α'),
(32, '社会', 'β1'),
(33, '社会', 'β2'),
(34, '社会', 'サッカー1'),
(35, '社会', 'サッカー2');


insert ignore into status(status_id,name) values
(1,'講習'),
(2,'個別'),
(3,'体験'),
(4,'本科');

insert ignore into students(id,el1,code,name) values
(1,1,1,'average');--全てのテストの平均点を紐づける平均くん